Tekla Open API Reference for Tekla Structures 2025
RebarMesh.LongitudinalSpacingMethod Property
 The type of spacing between rebar mesh bars. Used both for longitudinal and crossing bars. The options are (RebarMesh.RebarMeshSpacingMethodEnum.):
SPACING_TYPE_SAME_DISTANCE
SPACING_TYPE_MULTIPLE_VARYING_DISTANCES
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarMesh.RebarMeshSpacingMethodEnum LongitudinalSpacingMethod { get; set; }
Public Property LongitudinalSpacingMethod As RebarMesh.RebarMeshSpacingMethodEnum
	Get
	Set
Property Value
Type: RebarMesh.RebarMeshSpacingMethodEnum
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace